[{
    "company": "Rithm Messaging Inc.",
    "title": "Product Designer / Front-end Dev",
    "external": "http://rithm.me",
    "date_start": "July 2013",
    "date_end": "Present",
    "description_job": "Working as a product designer means I usually have to hustle and get a lot done in a day. Between working directly on the iOS and Android apps, I code up all of the web pages, Firefox and Kik apps. I get to learn from a combined experience between working on code and designing for various platforms, mobile and desktop."
}, {
    "company": "Basmati Labs Inc.",
    "title": "Co-founder / Product Designer",
    "external": "http://getmyrice.com/",
    "date_start": "November 2013",
    "date_end": "Present",
    "description_job": "Flexing those ui/ux muscles while leading the product. I base my decisions on data gathered from the app, this includes how users are using the app, where they are falling off and what they are intent on doing. This process allows me to be analytical as well as challenge myself with newer approaches."
}, {
    "company": "FanCrank Inc.",
    "title": "UI/UX Designer / Front-end Dev",
    "external": "http://fancrank.com/",
    "date_start": "October 2012",
    "date_end": "July 2013",
    "description_job": "Worked on creating a Facebook app which rewards users with points based on their interactions on fan pages. Worked directly with the product manager and the team to create a seamless desktop and mobile experience."
}, {
    "company": "Canadian Undergraduate Technology Conference",
    "title": "Design Lead",
    "external": "http://cutc.ca/",
    "date_start": "December 2011",
    "date_end": "July 2013",
    "description_job": "Setting a visual identity for CUTC, branding and designing a majority of materials including mobile app, web pages, print and any other visual media."
}, {
    "company": "Genesys Labs",
    "title": "UI/UX Design Intern",
    "external": "http://genesys.com/",
    "date_start": "December 2012",
    "date_end": "April 2013",
    "description_job": "Working as a user interface and user experience designer on various projects for mobile and desktop applications."
}, {
    "company": "Various",
    "title": "Design Lead: Shoebox App, HID Canada, BetterU, EPIC/EpCon",
    "external": "#",
    "date_start": "2009",
    "date_end": "Present",
    "description_job": "User interface and user experience designer on various projects for mobile, tablets and desktop applications."
}]
